packages/gql/__test__/k6/metrics/k6-output-remote.txt

         /\      Grafana   /‾‾/  
    /\  /  \     |\  __   /  /   
   /  \/    \    | |/ /  /   ‾‾\ 
  /          \   |   (  |  (‾)  |
 / __________ \  |_|\_\  \_____/ 

     execution: local
        script: __test__/k6/scripts/load-test.ts
        output: InfluxDBv1 (http://localhost:8086)

     scenarios: (100.00%) 1 scenario, 1000 max VUs, 2m30s max duration (incl. graceful stop):
              * default: Up to 1000 looping VUs for 2m0s over 3 stages (gracefulRampDown: 30s, gracefulStop: 30s)


running (0m01.0s), 0033/1000 VUs, 0 complete and 0 interrupted iterations
default   [   1% ] 0033/1000 VUs  0m01.0s/2m00.0s

running (0m02.0s), 0066/1000 VUs, 7 complete and 0 interrupted iterations
default   [   2% ] 0066/1000 VUs  0m02.0s/2m00.0s

running (0m03.0s), 0099/1000 VUs, 40 complete and 0 interrupted iterations
default   [   2% ] 0099/1000 VUs  0m03.0s/2m00.0s

running (0m04.0s), 0132/1000 VUs, 105 complete and 0 interrupted iterations
default   [   3% ] 0132/1000 VUs  0m04.0s/2m00.0s

running (0m05.0s), 0166/1000 VUs, 189 complete and 0 interrupted iterations
default   [   4% ] 0166/1000 VUs  0m05.0s/2m00.0s

running (0m06.0s), 0199/1000 VUs, 296 complete and 0 interrupted iterations
default   [   5% ] 0199/1000 VUs  0m06.0s/2m00.0s

running (0m07.0s), 0232/1000 VUs, 431 complete and 0 interrupted iterations
default   [   6% ] 0232/1000 VUs  0m07.0s/2m00.0s

running (0m08.0s), 0266/1000 VUs, 593 complete and 0 interrupted iterations
default   [   7% ] 0266/1000 VUs  0m08.0s/2m00.0s

running (0m09.0s), 0299/1000 VUs, 781 complete and 0 interrupted iterations
default   [   7% ] 0299/1000 VUs  0m09.0s/2m00.0s

running (0m10.0s), 0332/1000 VUs, 994 complete and 0 interrupted iterations
default   [   8% ] 0332/1000 VUs  0m10.0s/2m00.0s

running (0m11.0s), 0366/1000 VUs, 1221 complete and 0 interrupted iterations
default   [   9% ] 0366/1000 VUs  0m11.0s/2m00.0s

running (0m12.0s), 0399/1000 VUs, 1486 complete and 0 interrupted iterations
default   [  10% ] 0399/1000 VUs  0m12.0s/2m00.0s

running (0m13.0s), 0432/1000 VUs, 1782 complete and 0 interrupted iterations
default   [  11% ] 0432/1000 VUs  0m13.0s/2m00.0s

running (0m14.0s), 0465/1000 VUs, 2099 complete and 0 interrupted iterations
default   [  12% ] 0465/1000 VUs  0m14.0s/2m00.0s

running (0m15.0s), 0499/1000 VUs, 2431 complete and 0 interrupted iterations
default   [  12% ] 0499/1000 VUs  0m15.0s/2m00.0s

running (0m16.0s), 0532/1000 VUs, 2794 complete and 0 interrupted iterations
default   [  13% ] 0532/1000 VUs  0m16.0s/2m00.0s

running (0m17.0s), 0565/1000 VUs, 3182 complete and 0 interrupted iterations
default   [  14% ] 0565/1000 VUs  0m17.0s/2m00.0s

running (0m18.0s), 0599/1000 VUs, 3582 complete and 0 interrupted iterations
default   [  15% ] 0599/1000 VUs  0m18.0s/2m00.0s

running (0m19.0s), 0632/1000 VUs, 3967 complete and 0 interrupted iterations
default   [  16% ] 0632/1000 VUs  0m19.0s/2m00.0s

running (0m20.0s), 0665/1000 VUs, 4366 complete and 0 interrupted iterations
default   [  17% ] 0665/1000 VUs  0m20.0s/2m00.0s

running (0m21.0s), 0699/1000 VUs, 4748 complete and 0 interrupted iterations
default   [  17% ] 0699/1000 VUs  0m21.0s/2m00.0s

running (0m22.0s), 0732/1000 VUs, 5140 complete and 0 interrupted iterations
default   [  18% ] 0732/1000 VUs  0m22.0s/2m00.0s

running (0m23.0s), 0765/1000 VUs, 5536 complete and 0 interrupted iterations
default   [  19% ] 0765/1000 VUs  0m23.0s/2m00.0s

running (0m24.0s), 0798/1000 VUs, 5897 complete and 0 interrupted iterations
default   [  20% ] 0798/1000 VUs  0m24.0s/2m00.0s

running (0m25.0s), 0832/1000 VUs, 6304 complete and 0 interrupted iterations
default   [  21% ] 0832/1000 VUs  0m25.0s/2m00.0s

running (0m26.0s), 0865/1000 VUs, 6704 complete and 0 interrupted iterations
default   [  22% ] 0865/1000 VUs  0m26.0s/2m00.0s

running (0m27.0s), 0898/1000 VUs, 7099 complete and 0 interrupted iterations
default   [  22% ] 0898/1000 VUs  0m27.0s/2m00.0s

running (0m28.0s), 0932/1000 VUs, 7480 complete and 0 interrupted iterations
default   [  23% ] 0932/1000 VUs  0m28.0s/2m00.0s

running (0m29.0s), 0965/1000 VUs, 7858 complete and 0 interrupted iterations
default   [  24% ] 0965/1000 VUs  0m29.0s/2m00.0s

running (0m30.0s), 0998/1000 VUs, 8269 complete and 0 interrupted iterations
default   [  25% ] 0998/1000 VUs  0m30.0s/2m00.0s

running (0m31.0s), 1000/1000 VUs, 8668 complete and 0 interrupted iterations
default   [  26% ] 1000/1000 VUs  0m31.0s/2m00.0s

running (0m32.0s), 1000/1000 VUs, 9039 complete and 0 interrupted iterations
default   [  27% ] 1000/1000 VUs  0m32.0s/2m00.0s

running (0m33.0s), 1000/1000 VUs, 9421 complete and 0 interrupted iterations
default   [  27% ] 1000/1000 VUs  0m33.0s/2m00.0s

running (0m34.0s), 1000/1000 VUs, 9798 complete and 0 interrupted iterations
default   [  28% ] 1000/1000 VUs  0m34.0s/2m00.0s

running (0m35.0s), 1000/1000 VUs, 10194 complete and 0 interrupted iterations
default   [  29% ] 1000/1000 VUs  0m35.0s/2m00.0s

running (0m36.0s), 1000/1000 VUs, 10591 complete and 0 interrupted iterations
default   [  30% ] 1000/1000 VUs  0m36.0s/2m00.0s

running (0m37.0s), 1000/1000 VUs, 10956 complete and 0 interrupted iterations
default   [  31% ] 1000/1000 VUs  0m37.0s/2m00.0s

running (0m38.0s), 1000/1000 VUs, 11341 complete and 0 interrupted iterations
default   [  32% ] 1000/1000 VUs  0m38.0s/2m00.0s

running (0m39.0s), 1000/1000 VUs, 11739 complete and 0 interrupted iterations
default   [  32% ] 1000/1000 VUs  0m39.0s/2m00.0s

running (0m40.0s), 1000/1000 VUs, 12114 complete and 0 interrupted iterations
default   [  33% ] 1000/1000 VUs  0m40.0s/2m00.0s

running (0m41.0s), 1000/1000 VUs, 12503 complete and 0 interrupted iterations
default   [  34% ] 1000/1000 VUs  0m41.0s/2m00.0s

running (0m42.0s), 1000/1000 VUs, 12873 complete and 0 interrupted iterations
default   [  35% ] 1000/1000 VUs  0m42.0s/2m00.0s

running (0m43.0s), 1000/1000 VUs, 13280 complete and 0 interrupted iterations
default   [  36% ] 1000/1000 VUs  0m43.0s/2m00.0s

running (0m44.0s), 1000/1000 VUs, 13668 complete and 0 interrupted iterations
default   [  37% ] 1000/1000 VUs  0m44.0s/2m00.0s

running (0m45.0s), 1000/1000 VUs, 14041 complete and 0 interrupted iterations
default   [  37% ] 1000/1000 VUs  0m45.0s/2m00.0s

running (0m46.0s), 1000/1000 VUs, 14420 complete and 0 interrupted iterations
default   [  38% ] 1000/1000 VUs  0m46.0s/2m00.0s

running (0m47.0s), 1000/1000 VUs, 14810 complete and 0 interrupted iterations
default   [  39% ] 1000/1000 VUs  0m47.0s/2m00.0s

running (0m48.0s), 1000/1000 VUs, 15216 complete and 0 interrupted iterations
default   [  40% ] 1000/1000 VUs  0m48.0s/2m00.0s

running (0m49.0s), 1000/1000 VUs, 15594 complete and 0 interrupted iterations
default   [  41% ] 1000/1000 VUs  0m49.0s/2m00.0s

running (0m50.0s), 1000/1000 VUs, 15955 complete and 0 interrupted iterations
default   [  42% ] 1000/1000 VUs  0m50.0s/2m00.0s

running (0m51.0s), 1000/1000 VUs, 16335 complete and 0 interrupted iterations
default   [  42% ] 1000/1000 VUs  0m51.0s/2m00.0s

running (0m52.0s), 1000/1000 VUs, 16750 complete and 0 interrupted iterations
default   [  43% ] 1000/1000 VUs  0m52.0s/2m00.0s

running (0m53.0s), 1000/1000 VUs, 17137 complete and 0 interrupted iterations
default   [  44% ] 1000/1000 VUs  0m53.0s/2m00.0s

running (0m54.0s), 1000/1000 VUs, 17501 complete and 0 interrupted iterations
default   [  45% ] 1000/1000 VUs  0m54.0s/2m00.0s

running (0m55.0s), 1000/1000 VUs, 17881 complete and 0 interrupted iterations
default   [  46% ] 1000/1000 VUs  0m55.0s/2m00.0s

running (0m56.0s), 1000/1000 VUs, 18297 complete and 0 interrupted iterations
default   [  47% ] 1000/1000 VUs  0m56.0s/2m00.0s

running (0m57.0s), 1000/1000 VUs, 18669 complete and 0 interrupted iterations
default   [  47% ] 1000/1000 VUs  0m57.0s/2m00.0s

running (0m58.0s), 1000/1000 VUs, 19043 complete and 0 interrupted iterations
default   [  48% ] 1000/1000 VUs  0m58.0s/2m00.0s

running (0m59.0s), 1000/1000 VUs, 19443 complete and 0 interrupted iterations
default   [  49% ] 1000/1000 VUs  0m59.0s/2m00.0s

running (1m00.0s), 1000/1000 VUs, 19826 complete and 0 interrupted iterations
default   [  50% ] 1000/1000 VUs  1m00.0s/2m00.0s

running (1m01.0s), 1000/1000 VUs, 20215 complete and 0 interrupted iterations
default   [  51% ] 1000/1000 VUs  1m01.0s/2m00.0s

running (1m02.0s), 1000/1000 VUs, 20584 complete and 0 interrupted iterations
default   [  52% ] 1000/1000 VUs  1m02.0s/2m00.0s

running (1m03.0s), 1000/1000 VUs, 20986 complete and 0 interrupted iterations
default   [  52% ] 1000/1000 VUs  1m03.0s/2m00.0s

running (1m04.0s), 1000/1000 VUs, 21368 complete and 0 interrupted iterations
default   [  53% ] 1000/1000 VUs  1m04.0s/2m00.0s

running (1m05.0s), 1000/1000 VUs, 21759 complete and 0 interrupted iterations
default   [  54% ] 1000/1000 VUs  1m05.0s/2m00.0s

running (1m06.0s), 1000/1000 VUs, 22123 complete and 0 interrupted iterations
default   [  55% ] 1000/1000 VUs  1m06.0s/2m00.0s

running (1m07.0s), 1000/1000 VUs, 22514 complete and 0 interrupted iterations
default   [  56% ] 1000/1000 VUs  1m07.0s/2m00.0s

running (1m08.0s), 1000/1000 VUs, 22904 complete and 0 interrupted iterations
default   [  57% ] 1000/1000 VUs  1m08.0s/2m00.0s

running (1m09.0s), 1000/1000 VUs, 23299 complete and 0 interrupted iterations
default   [  57% ] 1000/1000 VUs  1m09.0s/2m00.0s

running (1m10.0s), 1000/1000 VUs, 23665 complete and 0 interrupted iterations
default   [  58% ] 1000/1000 VUs  1m10.0s/2m00.0s

running (1m11.0s), 1000/1000 VUs, 24064 complete and 0 interrupted iterations
default   [  59% ] 1000/1000 VUs  1m11.0s/2m00.0s

running (1m12.0s), 1000/1000 VUs, 24444 complete and 0 interrupted iterations
default   [  60% ] 1000/1000 VUs  1m12.0s/2m00.0s

running (1m13.0s), 1000/1000 VUs, 24842 complete and 0 interrupted iterations
default   [  61% ] 1000/1000 VUs  1m13.0s/2m00.0s

running (1m14.0s), 1000/1000 VUs, 25242 complete and 0 interrupted iterations
default   [  62% ] 1000/1000 VUs  1m14.0s/2m00.0s

running (1m15.0s), 1000/1000 VUs, 25621 complete and 0 interrupted iterations
default   [  62% ] 1000/1000 VUs  1m15.0s/2m00.0s

running (1m16.0s), 1000/1000 VUs, 25999 complete and 0 interrupted iterations
default   [  63% ] 1000/1000 VUs  1m16.0s/2m00.0s

running (1m17.0s), 1000/1000 VUs, 26383 complete and 0 interrupted iterations
default   [  64% ] 1000/1000 VUs  1m17.0s/2m00.0s

running (1m18.0s), 1000/1000 VUs, 26764 complete and 0 interrupted iterations
default   [  65% ] 1000/1000 VUs  1m18.0s/2m00.0s

running (1m19.0s), 1000/1000 VUs, 27150 complete and 0 interrupted iterations
default   [  66% ] 1000/1000 VUs  1m19.0s/2m00.0s

running (1m20.0s), 1000/1000 VUs, 27539 complete and 0 interrupted iterations
default   [  67% ] 1000/1000 VUs  1m20.0s/2m00.0s

running (1m21.0s), 1000/1000 VUs, 27922 complete and 0 interrupted iterations
default   [  67% ] 1000/1000 VUs  1m21.0s/2m00.0s

running (1m22.0s), 1000/1000 VUs, 28303 complete and 0 interrupted iterations
default   [  68% ] 1000/1000 VUs  1m22.0s/2m00.0s

running (1m23.0s), 1000/1000 VUs, 28699 complete and 0 interrupted iterations
default   [  69% ] 1000/1000 VUs  1m23.0s/2m00.0s

running (1m24.0s), 1000/1000 VUs, 29074 complete and 0 interrupted iterations
default   [  70% ] 1000/1000 VUs  1m24.0s/2m00.0s

running (1m25.0s), 1000/1000 VUs, 29461 complete and 0 interrupted iterations
default   [  71% ] 1000/1000 VUs  1m25.0s/2m00.0s

running (1m26.0s), 1000/1000 VUs, 29852 complete and 0 interrupted iterations
default   [  72% ] 1000/1000 VUs  1m26.0s/2m00.0s

running (1m27.0s), 1000/1000 VUs, 30237 complete and 0 interrupted iterations
default   [  72% ] 1000/1000 VUs  1m27.0s/2m00.0s

running (1m28.0s), 1000/1000 VUs, 30628 complete and 0 interrupted iterations
default   [  73% ] 1000/1000 VUs  1m28.0s/2m00.0s

running (1m29.0s), 1000/1000 VUs, 31003 complete and 0 interrupted iterations
default   [  74% ] 1000/1000 VUs  1m29.0s/2m00.0s

running (1m30.0s), 1000/1000 VUs, 31396 complete and 0 interrupted iterations
default   [  75% ] 1000/1000 VUs  1m30.0s/2m00.0s

running (1m31.0s), 1000/1000 VUs, 31775 complete and 0 interrupted iterations
default   [  76% ] 1000/1000 VUs  1m31.0s/2m00.0s

running (1m32.0s), 1000/1000 VUs, 32192 complete and 0 interrupted iterations
default   [  77% ] 1000/1000 VUs  1m32.0s/2m00.0s

running (1m33.0s), 1000/1000 VUs, 32575 complete and 0 interrupted iterations
default   [  77% ] 1000/1000 VUs  1m33.0s/2m00.0s

running (1m34.0s), 1000/1000 VUs, 32959 complete and 0 interrupted iterations
default   [  78% ] 1000/1000 VUs  1m34.0s/2m00.0s

running (1m35.0s), 0999/1000 VUs, 33327 complete and 0 interrupted iterations
default   [  79% ] 0999/1000 VUs  1m35.0s/2m00.0s

running (1m36.0s), 0998/1000 VUs, 33724 complete and 0 interrupted iterations
default   [  80% ] 0998/1000 VUs  1m36.0s/2m00.0s

running (1m37.0s), 0998/1000 VUs, 34119 complete and 0 interrupted iterations
default   [  81% ] 0998/1000 VUs  1m37.0s/2m00.0s

running (1m38.0s), 0998/1000 VUs, 34499 complete and 0 interrupted iterations
default   [  82% ] 0998/1000 VUs  1m38.0s/2m00.0s

running (1m39.0s), 0998/1000 VUs, 34853 complete and 0 interrupted iterations
default   [  82% ] 0998/1000 VUs  1m39.0s/2m00.0s

running (1m40.0s), 0998/1000 VUs, 35257 complete and 0 interrupted iterations
default   [  83% ] 0998/1000 VUs  1m40.0s/2m00.0s

running (1m41.0s), 0998/1000 VUs, 35660 complete and 0 interrupted iterations
default   [  84% ] 0998/1000 VUs  1m41.0s/2m00.0s

running (1m42.0s), 0998/1000 VUs, 36042 complete and 0 interrupted iterations
default   [  85% ] 0998/1000 VUs  1m42.0s/2m00.0s

running (1m43.0s), 0998/1000 VUs, 36414 complete and 0 interrupted iterations
default   [  86% ] 0998/1000 VUs  1m43.0s/2m00.0s

running (1m44.0s), 0998/1000 VUs, 36804 complete and 0 interrupted iterations
default   [  87% ] 0998/1000 VUs  1m44.0s/2m00.0s

running (1m45.0s), 0996/1000 VUs, 37214 complete and 0 interrupted iterations
default   [  87% ] 0996/1000 VUs  1m45.0s/2m00.0s

running (1m46.0s), 0979/1000 VUs, 37590 complete and 0 interrupted iterations
default   [  88% ] 0979/1000 VUs  1m46.0s/2m00.0s

running (1m47.0s), 0941/1000 VUs, 37956 complete and 0 interrupted iterations
default   [  89% ] 0941/1000 VUs  1m47.0s/2m00.0s

running (1m48.0s), 0912/1000 VUs, 38297 complete and 0 interrupted iterations
default   [  90% ] 0912/1000 VUs  1m48.0s/2m00.0s

running (1m49.0s), 0881/1000 VUs, 38624 complete and 0 interrupted iterations
default   [  91% ] 0881/1000 VUs  1m49.0s/2m00.0s

running (1m50.0s), 0848/1000 VUs, 38934 complete and 0 interrupted iterations
default   [  92% ] 0848/1000 VUs  1m50.0s/2m00.0s

running (1m51.0s), 0811/1000 VUs, 39201 complete and 0 interrupted iterations
default   [  92% ] 0811/1000 VUs  1m51.0s/2m00.0s

running (1m52.0s), 0782/1000 VUs, 39445 complete and 0 interrupted iterations
default   [  93% ] 0782/1000 VUs  1m52.0s/2m00.0s

running (1m53.0s), 0748/1000 VUs, 39677 complete and 0 interrupted iterations
default   [  94% ] 0748/1000 VUs  1m53.0s/2m00.0s

running (1m54.0s), 0713/1000 VUs, 39878 complete and 0 interrupted iterations
default   [  95% ] 0713/1000 VUs  1m54.0s/2m00.0s

running (1m55.0s), 0679/1000 VUs, 40042 complete and 0 interrupted iterations
default   [  96% ] 0679/1000 VUs  1m55.0s/2m00.0s

running (1m56.0s), 0645/1000 VUs, 40196 complete and 0 interrupted iterations
default   [  97% ] 0645/1000 VUs  1m56.0s/2m00.0s

running (1m57.0s), 0610/1000 VUs, 40315 complete and 0 interrupted iterations
default   [  97% ] 0610/1000 VUs  1m57.0s/2m00.0s

running (1m58.0s), 0575/1000 VUs, 40409 complete and 0 interrupted iterations
default   [  98% ] 0575/1000 VUs  1m58.0s/2m00.0s

running (1m59.0s), 0544/1000 VUs, 40478 complete and 0 interrupted iterations
default   [  99% ] 0544/1000 VUs  1m59.0s/2m00.0s

running (2m00.0s), 0512/1000 VUs, 40525 complete and 0 interrupted iterations
default   [ 100% ] 0512/1000 VUs  2m00.0s/2m00.0s

running (2m01.0s), 0457/1000 VUs, 40548 complete and 32 interrupted iterations
default ↓ [ 100% ] 0512/1000 VUs  2m0s

running (2m02.0s), 0423/1000 VUs, 40549 complete and 65 interrupted iterations
default ↓ [ 100% ] 0512/1000 VUs  2m0s

running (2m03.0s), 0390/1000 VUs, 40549 complete and 98 interrupted iterations
default ↓ [ 100% ] 0512/1000 VUs  2m0s

running (2m04.0s), 0356/1000 VUs, 40549 complete and 132 interrupted iterations
default ↓ [ 100% ] 0512/1000 VUs  2m0s

running (2m05.0s), 0325/1000 VUs, 40549 complete and 163 interrupted iterations
default ↓ [ 100% ] 0512/1000 VUs  2m0s

running (2m06.0s), 0292/1000 VUs, 40549 complete and 196 interrupted iterations
default ↓ [ 100% ] 0512/1000 VUs  2m0s

running (2m07.0s), 0258/1000 VUs, 40549 complete and 230 interrupted iterations
default ↓ [ 100% ] 0512/1000 VUs  2m0s

running (2m08.0s), 0225/1000 VUs, 40549 complete and 263 interrupted iterations
default ↓ [ 100% ] 0512/1000 VUs  2m0s

running (2m09.0s), 0192/1000 VUs, 40549 complete and 296 interrupted iterations
default ↓ [ 100% ] 0512/1000 VUs  2m0s

running (2m10.0s), 0158/1000 VUs, 40549 complete and 330 interrupted iterations
default ↓ [ 100% ] 0512/1000 VUs  2m0s

running (2m11.0s), 0125/1000 VUs, 40549 complete and 363 interrupted iterations
default ↓ [ 100% ] 0512/1000 VUs  2m0s

running (2m12.0s), 0092/1000 VUs, 40549 complete and 396 interrupted iterations
default ↓ [ 100% ] 0512/1000 VUs  2m0s

running (2m13.0s), 0059/1000 VUs, 40549 complete and 430 interrupted iterations
default ↓ [ 100% ] 0512/1000 VUs  2m0s

running (2m14.0s), 0025/1000 VUs, 40549 complete and 463 interrupted iterations
default ↓ [ 100% ] 0512/1000 VUs  2m0s

     ✗ is status 200
      ↳  0% — ✓ 0 / ✗ 41037
     ✓ no errors

     checks.........................: 50.00%    41037 out of 82074
     data_received..................: 103 MB    760 kB/s
     data_sent......................: 102 MB    758 kB/s
   ✗ errors.........................: 100.00%   41037 out of 41037
     http_req_blocked...............: avg=898.71µs   min=0s    med=1µs   max=1.41s   p(90)=1µs    p(95)=2µs     
     http_req_connecting............: avg=65.67µs    min=0s    med=0s    max=52.83ms p(90)=0s     p(95)=0s      
   ✓ http_req_duration..............: avg=95.18ms    min=164µs med=360µs max=1m0s    p(90)=2.69ms p(95)=360.69ms
       { expected_response:true }...: avg=814.82µs   min=164µs med=344µs max=59.96s  p(90)=1.02ms p(95)=1.32ms  
     http_req_failed................: 9.28%     41525 out of 447015
     http_req_receiving.............: avg=1.97ms     min=0s    med=6µs   max=60.17ms p(90)=21µs   p(95)=27.69ms 
     http_req_sending...............: avg=6.07µs     min=1µs   med=2µs   max=7.23ms  p(90)=13µs   p(95)=21µs    
     http_req_tls_handshaking.......: avg=831.83µs   min=0s    med=0s    max=1.38s   p(90)=0s     p(95)=0s      
     http_req_waiting...............: avg=93.2ms     min=156µs med=349µs max=1m0s    p(90)=2.66ms p(95)=333.86ms
     http_reqs......................: 447015    3316.243014/s
     iteration_duration.............: avg=1.32s      min=1.18s med=1.37s max=1m1s    p(90)=1.41s  p(95)=1.41s   
     iterations.....................: 40549     300.818402/s
     postgres_cpu_usage.............: 0         min=0               max=0.044444 
     postgres_memory_usage..........: 17.378906 min=17.378906       max=18.761719
     postgres_network_receive.......: 0         min=0               max=0        
     postgres_network_transmit......: 0         min=0               max=0        
     query_token_prices.............: avg=329.90557  min=178   med=375   max=3506    p(90)=407    p(95)=413     
     query_top_tokens...............: avg=320.311177 min=177   med=373   max=2472    p(90)=407    p(95)=411     
   ✗ timescale_cache_hit_ratio......: 0         min=0               max=0        
     timescale_cpu_usage............: 0         min=0               max=0.066667 
     timescale_memory_usage.........: 18.113281 min=16.75           max=18.46875 
     timescale_network_receive......: 0         min=0               max=0        
     timescale_network_transmit.....: 0         min=0               max=0        
     vus............................: 25        min=25              max=1000     
     vus_max........................: 1000      min=1000            max=1000     


running (2m14.8s), 0000/1000 VUs, 40549 complete and 488 interrupted iterations
default ✓ [ 100% ] 0000/1000 VUs  2m0s